# THIS FILE IS AUTOMATICALLY GENERATED
# Project: E:\PSoC_Creator\CY8CKIT-059\CY8CKIT-059_JJY_Receiver\CY8CKIT-059_JJY_Reciever.cydsn\CY8CKIT-059_JJY_Reciever.cyprj
# Date: Thu, 13 Feb 2020 04:06:14 GMT
#set_units -time ns
create_clock -name {clock_1(routed)} -period 1000 -waveform {0 500} [list [get_pins {ClockBlock/dclk_1}]]
create_clock -name {WaveDAC8_1_DacClk(routed)} -period 12500 -waveform {0 6250} [list [get_pins {ClockBlock/dclk_2}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 15.151515151515152 -waveform {0 7.57575757575758} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 15.151515151515152 -waveform {0 7.57575757575758} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 67 133} -nominal_period 1000 [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {WaveDAC8_1_DacClk} -source [get_pins {ClockBlock/clk_sync}] -edges {1 825 1651} -nominal_period 12500 [list [get_pins {ClockBlock/dclk_glb_2}]]
create_generated_clock -name {timer_clock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 65537 131073} [list [get_pins {ClockBlock/dclk_glb_3}]]
create_generated_clock -name {counter_clock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 3 5} -nominal_period 41.666666666666664 [list [get_pins {ClockBlock/dclk_glb_0}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for E:\PSoC_Creator\CY8CKIT-059\CY8CKIT-059_JJY_Receiver\CY8CKIT-059_JJY_Reciever.cydsn\TopDesign\TopDesign.cysch
# Project: E:\PSoC_Creator\CY8CKIT-059\CY8CKIT-059_JJY_Receiver\CY8CKIT-059_JJY_Reciever.cydsn\CY8CKIT-059_JJY_Reciever.cyprj
# Date: Thu, 13 Feb 2020 04:06:05 GMT
